Revit 2026 API

# RebarSpliceByRulesResult Class

---

Class that encapsulates the result of the splice by rules operation.

SystemObject Autodesk.Revit.DB.StructureRebarSpliceByRulesResult

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarSpliceByRulesResult : IDisposable
```
```vb
Public Class RebarSpliceByRulesResult
	Implements IDisposable
```
```cpp
public ref class RebarSpliceByRulesResult : IDisposable
```
```fsharp
type RebarSpliceByRulesResult =
    class
        interface IDisposable
    end
```

The RebarSpliceByRulesResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Error | Identifies the error that occured during the splice by rules operation. In case of success the value of this property will be Success. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarSpliceByRulesResult |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSpliceGeometries | Gets the RebarSpliceGeometry collection which is the result of the splice by rules operation. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class contains a collection of RebarSpliceGeometry which is the result of the splice and a RebarSpliceByRulesError member. After splice by rules operation check the Error member for RebarSpliceByRulesError.Success value and retrieve the RebarSpliceGeometry collection. If the splice by rules operation fails the Error member will contain a meaninful error.

#### Reference

Autodesk.Revit.DB.Structure Namespace